martinbaillie.org
#+seq_todo: TODO DRAFT DONE
#+property: header-args :eval never-export
#+startup: indent
#+author: Martin Baillie
#+hugo_base_dir: ./
** DONE Gotchas in the Go Network Packages Defaults :aws:go:kubernetes:
CLOSED: [2021-03-21 Sun 21:19]
:PROPERTIES:
:EXPORT_FILE_NAME: gotchas-in-the-go-network-packages-defaults
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :tldr Things I keep forgetting about Go's network packages defaults.
:EXPORT_OPTIONS: toc:nil
:END:
*** Fool Me Once
:PROPERTIES:
:UNNUMBERED: notoc
:END:
I have been keeping a wee =.org= file of gotchas in the defaults of Go's various
=net= packages for a while now. I pull it up each time I'm building a service
with the standard library, just to make sure I don't miss something that I have
already hit in the past. Let's call it learning from one's mistakes where the
one in question has a shocking memory.

I've just this week added another entry after getting to the root cause of a
production issue and thought to myself that there was enough in the file to
merit tidying up and posting.

Well, I have nothing else to do on this [[https://en.wikipedia.org/wiki/Severe_storm_events_in_Sydney#2020s%E2%80%93present][infamously soggy]] Sunday in Sydney so
what follows is the current list in all its glory, with some added explanation
for good measure. Just bear in mind that the items mostly pertain to HTTP-based
clients and servers from using Go at (relative) scale in service oriented
architectures. Also, I think they are all still relevant as of Go 1.16 but happy
to be corrected on that.

#+TOC: headlines 1
*** Timeouts
Set them!

The network is [[https://queue.acm.org/detail.cfm?id=2655736][unreliable]] and the standard library default clients and
servers do not set their main timeouts, and all of them interpret the zero value
as _infinity_ to boot. Timeouts are subjective to the use case and the Go core
team have steered clear of making any sweeping generalisations.

#+begin_quote
NOTE: This includes all use of the package level convenience functions too:
=http.Get= and client friends, =http.ListenAndServe= and server friends.
#+end_quote

A corollary to this is you should practically *always* have a customised
=http.Client= and/or =http.Server= in a production Go service.
**** Client timeouts
For clients you often only need to configure the main timeout. It covers the E2E
exchange and is most likely how your mental model of an RPC works:
#+begin_src go
c := &http.Client{
	Timeout: 5 * time.Second,
}
#+end_src

This timeout includes any HTTP =3xx= redirect durations, the reading of response
body and the connection and handshake times (unless a reused connection). I find I am usually done here regarding clients.

However, for granular control over these individual properties and more, you
need to drop lower to the underlying transport:
#+begin_src go
c := &http.Client{
	Timeout: 5 * time.Second,
	Transport: &http.Transport{
		DialContext: (&net.Dialer{
			// This is the TCP connect timeout in this instance.
			Timeout: 2500 * time.Millisecond,
		}).DialContext,
		TLSHandshakeTimeout: 2500 * time.Millisecond,
	},
}
#+end_src

#+begin_quote
NOTE: Since response bodies are read after the client method has returned you
need to use a =time.Timer= if you want to enforce read time limits.
#+end_quote

There are more timeouts on the transport that I have never had a need for such
as the =ResponseHeaderTimeout= (time to wait for response headers after request
writing ends) and the =ExpectContinueTimeout= (time to wait for a =100-Continue=
if using HTTP Expect headers).

There are also settings related to reuse, such as the transport's
=IdleConnTimeout= and dialer's =KeepAlive= settings. These are deserved of their
own [[#connection-pooling][section]].
**** Server timeouts
In the same vein as you not wanting a server to hold your client's requests
hostage because they have no timeout, when writing a Go HTTP server you have the
inverse consideration: you don't want badly behaving or laggy clients holding
your server's file descriptors hostage.

To avoid this, you should always have a customised =http.Server= instance:
#+begin_src go
s := &http.Server{
	ReadTimeout:  2500 * time.Millisecond,
	WriteTimeout: 5 * time.Second,
}
#+end_src

=ReadTimeout= here covers the time taken to read the request headers and
optionally body, and =WriteTimeout= covers the duration to the end of the
response write.

However, if the server is processing TLS then the =WriteTimeout= ticker actually
starts as soon as that first byte of the TLS handshake is read. In practice this
means you should factor in the whole =ReadTimeout= and then whatever you want to
accept for writes on top of that.

Similar to the main =http.Client.Timeout= value, these are the two main server
timeouts that you should think about appropriate situational values for, but
there are a few others that give more granular control (such as the time to read
and write headers respectively). Again, I have never had a need to use them.

-----

These timeouts cover poorly behaving clients. But with a server, you should have
a think about how long you are willing to accept as a *request handling
duration* as well. I mention mental models of client timeouts above; I would
argue this is the server-side version that intuitively springs to mind when you
think: /"server timeout"/.

With Go's =http.Server= you could implement these timeouts with context tickers
in the handler funcs themselves. You could also use the =TimeoutHandler= helper
wrapper:
#+begin_src go
func TimeoutHandler(h Handler, dt time.Duration, msg string) Handler
#+end_src

Wrapping with this means business-as-usual until =dt= is breached at which point
a 503 is written down the pipe to the client with the optional body =msg=.
*** HTTP Response Bodies
Close them!

As a client you might not care about the content of your response bodies or you
might be anticipating empty responses. Either way, you should close them off.
The standard library does not do it on your behalf and this can hold up
connections in the client's pool preventing reuse (i.e. if using HTTP/1.x
keep-alives) or worse, exhaust host file handles.

The standard library does however guarantee response bodies to be non-nil even
in the cases of a response sans body or with a zero-length body. So, to close things out
safely the following suffices:
#+begin_src go
res, err := client.Do(req)
if err != nil {
	return err
}
defer res.Body.Close()
...
#+end_src

If you are not going to do anything with the body then it is still important to
read it to completion. To not do so affects the propensity for reuse,
particularly if the server is pushing a lot of data. Flush the body with:
#+begin_src go
_, err := io.Copy(ioutil.Discard, res.Body)
#+end_src

#+begin_quote
NOTE: Depending on the scenario, it might be pertinent to make an attempt to
reuse the connection, but then also more efficient to close it if the server is
pushing too much data. =io.LimitedReader= can help here.
#+end_quote
