content/wrote/gotchas-in-the-go-network-packages-defaults.md

## HTTP/1.x Keep-alives {#http-1-dot-x-keep-alives}

Speaking of reuse, keep-alives are Go's default but sometimes you don't want
them. Case in point, I had a service acting as a webhook transmitter a few years
ago. It needed to make requests to many varied upstream targets (almost never
the same).

The easiest way to turn the default behaviour off is to wire a custom transport
into the client (which I find I'm always doing anyway for some of the other
reasons in this fieldnote):

```go
client := &http.Client{
    &http.Transport{
        DisableKeepAlives: true
    }
}
```

You can, however, also do this per request by telling the Go client to close it
for you:

```go
req.Close = true
```

Or otherwise signalling a well-behaving server to add a `Connection: close`
response header with which the Go client will know what to do.

```go
req.Header.Add("Connection", "close")
```

## Connection Pooling {#connection-pooling}

Continuing with the theme of reuse. In the micro-SOAs I find myself working in,
I am actually **much less likely** to be building that webhook transmitter service
above than I am a service that needs to integrate at high frequency but to only
a few upstreams (e.g. a cloud datastore/queue and a dependant API or two).

I would argue in this more common scenario the Go `http.Client` defaults work
against you.

By that I mean there are some [properties](https://golang.org/src/net/http/transport.go) exhibited by the client's default
transport with regards to connection pooling that you should always be mindful
of:

```go
var DefaultTransport RoundTripper = &Transport{
	MaxIdleConns:          100,
	IdleConnTimeout:       90 * time.Second,
}
...
const DefaultMaxIdleConnsPerHost = 2
```

The relationship between these three settings can be summarised as follows: a connection pool is retained of size 100, but **only 2 per target host**, and if a connection remains unutilised for 90 seconds it will be removed and closed.

So take the scenario of 100 goroutines sharing the same or default `http.Client`
to make requests to the same upstream dependency (this is not so contrived if
your client is itself also a server part of a larger microservice ecosystem,
forking routines per request it receives). 98 of those 100 connections get
**closed immediately**.

First things first, the means your service is working harder. There are myriad
connection establishment costs: kernel network stack processing and allocation;
DNS lookups, of which there may be <span class="underline">many</span> (read about `resolv.conf(5):ndots:n`
especially if you run [Kubernetes clusters](https://pracucci.com/kubernetes-dns-resolution-ndots-options-and-why-it-may-affect-application-performances.html)); as well as the TCP and TLS
handshakes to get through.

This is of course not optimal, but there is another hidden cost that has bitten
me in the past, rendering entire hosts useless: **closed != closed** (in Linux
anyway).

The kernel actually transitions the socket to a `TIME_WAIT` state, the purpose
of which being primarily to prevent delayed packets from one connection being
accepted by a subsequent connection. The kernel will keep these around for ~60s
(very hard to change in Linux as per [RFC793](https://tools.ietf.org/html/rfc793) adherence).

A buildup of `TIME_WAIT` sockets can have adverse effects on the resources of a
busy host.

For one, there is the additional CPU and memory to maintain the socket structure
in the kernel, but most critically there is the slot in the connection table. A
slot in use means another connection with the same quadruplet (source addr:port,
dest addr:port) cannot exist, and this in turn can result in **ephemeral port
exhaustion** — the dreaded `EADDRNOTAVAIL`.

## Validating URIs {#validating-uris}

This is a small one, but as far as I'm concerned, the `url.Parse` method is
essentially infallible and it trips me up all the bloody time. You almost always
want [`url.ParseRequestURI`](https://golang.org/pkg/net/url/#ParseRequestURI) and then some further checks if you are wanting to
filter out relative URLs.

## DNS Caching {#dns-caching}

Unlike the JVM, there is no builtin DNS cache in the Go standard runtime. This
is a double edged sword. I'm personally thankful for this default after been
burned countless times by that JVM cache in a past life. At the same time, it is
something to always be cognisant of when trying to produce an optimised Go
service.

The Go core team's stance is you should defer to the underlying host platform to
support your DNS caching needs by way of something like [dnsmasq](https://thekelleys.org.uk/dnsmasq/doc.html). However, it is
worth pointing out that you are not always in control of that situation. For
example, AWS Lambda's runtime sandbox contains a single remote Route53 address
in `/etc/resolv.conf` and provides no sandbox-local cache server.

Another option you have in this situation is to override the `DialContext` on
`http.Transport` (as seems to be the general theme of this fieldnote) and wire
in an in-memory cache. I can recommend [dnscache](https://github.com/rs/dnscache) for this purpose.

> NOTE: There is also the package singleton `net.DefaultResolver` that you may
> need to consider overriding if you don't have full control over your client's
> transport.

You might consider one of these options if you have latency-sensitive services
with only a couple of upstream dependencies. Those services will otherwise need
to continually dial that same unchanging couple of domains by default.

I say "by default" because you might have a well-tuned set of reused connections
(perhaps even in thanks to the section on [connection pooling](#connection-pooling)). If that's the
case then caveat emptor—I have another piece of anecdata for you.

At my previous client I had an issue where a high volume Go-based service acting
(in part) as a reverse proxy kept proxying the same dead backend endpoints. This
was because the backend target used DNS to do blue/green rollouts of new
versions, and was occurring despite the host having a TTL-respecting DNS cache.

The problem was the service was reusing the connections so fast that the idle
timeouts were never breached.

As of Go 1.16, nothing in the default runtime will force those established
connections to close and thus get updated resolved IPs for hostnames, forcing
you to get creative with a separate goroutine to call
`transport.CloseIdleConnections()` on an interval which is less than ideal.
While it is [very easy](https://golang.org/pkg/net/http/httputil/#ReverseProxy) to write a reverse proxy in Go, my mistake here was not
deferring to something more dedicated and endpoint-aware (like the excellent
[Envoy proxy](https://www.envoyproxy.io/)).
