content/wrote/gotchas-in-the-go-network-packages-defaults.md

## Masqueraded DualStack `net.Dial()` Errors {#masqueraded-dualstack-net-dot-dial-errors}

This one is nuanced but is a _belter_ if it hits and it can surface (as it did for
me) even if you're not actively using IPv6.

Take a stock Amazon EKS worker node as an example. At the time of writing this
the EKS optimised AMI has the following default traits:

1.  The Docker daemons do not have the experimental [IPv6 flag](https://docs.docker.com/config/daemon/ipv6/) enabled and so will
    not configure IPv6 addresses on the container virtual network interfaces.
2.  But the kernels do have IPv6 support enabled, meaning `/proc/net` gets the
    IPv6 constructs (even in container namespaces) and some other things are
    inferred from there, most critically, `/etc/hosts` receiving two default
    entries for loopback: `127.0.0.1` and `::1`.

Now suppose you have a Go service that calls another over loopback, such as a process sidecar, but you naively resolve the loopback address using `localhost` hostname.

> TL;DR: This is where you went wrong. Save yourself the trouble, stop here and
> use `127.0.0.1` or `::1` depending on your target stack unless you have a good
> reason not to. Read on for why you might want to do that.

You don't notice during development, but in an integrated environment running at
scale you see sporadically recurring `::1 cannot assign requested address`
emitted from the dialer. However, you check the host and ephemeral ports are
_absolutely fine_. There goes that theory.

What's with that `::1` IPv6 address family error though? It's concerning because
from the AMI traits above, we know that a client resolving that address is going
to have a bad time connecting given there's no network interface actually bound
to it. But then again, if that were true why does it not fail _all_ the time?

Well, it could be that the Go dialer is masquerading the real error—the **IPv4
error**!

This can happen because of a few subtle defaults:

1.  Firstly, when presented with multiple addresses for the same hostname, the Go
    dialer [sorts and selects](https://golang.org/src/net/addrselect.go) addresses according to [RFC6724](https://tools.ietf.org/html/rfc6724) and critically, this
    RFC outlines a preference for the IPv6 **first**.

2.  Then, because Go's default network transport also has
    [RFC6555](https://tools.ietf.org/html/rfc6555) support (aka. Happy Eyeballs /
    Dual Stack), it will try to dial both address families in parallel but give
    the primary IPv6 a 300 millisecond head start. If the primary fails fast
    (which it would always do in this case due to the non-existent IPv6 interface
    address), then the head start is cancelled and IPv4 is tried immediately. All
    good so far. However, if both addresses fail to dial, only the **primary (i.e.
    IPv6) error is returned**.

So if your IPv4 address is failing to dial sporadically (say, for example, a
laggy upstream is causing sporadic connect timeouts) the error presented will be
the irrelevant and always failing to dial IPv6 `::1 cannot assign requested address` instead of the much more helpful IPv4 `connect timeout`.

## `net.IP` is Mutable {#net-dot-ip-is-mutable}

This one bit me in production, albeit when I was doing something stupid. Don't
be tricked into thinking `net.IP` is an immutable data structure. It is in fact
a transparent type aliased to `[]byte`. Anything you pass it to could mutate it
and Sod's/Murphy's Law says it will.

## Bonus: GOMAXPROCS, Containers and the CFS {#bonus-gomaxprocs-containers-and-the-cfs}

A bonus entry about a default behaviour which, while not specifically related to
the `net` packages, sure can affect their performance indirectly.

Go will use the `GOMAXPROCS` runtime variable value at init to decide how many
real OS threads to multiplex all user-level Go routines across. By default it is
set to the number of logical CPUs discovered in the host environment and I
suppose this is another example of the Go core team needing to settle on a
sensible default i.e. the number of logical CPUs in a generalised context is
what provides the highest performance.

Unfortunately the Go runtime happens to also be unaware of CFS quotas, and
multi-tenant container orchestration platforms (like Kubernetes) will default to
using these to enforce their respective CPU restriction concepts on running
container's cgroups.

> NOTE: CFS here being the Linux kernel's [Completely Fair Scheduler](https://en.wikipedia.org/wiki/Completely%5FFair%5FScheduler)—a proportional
> share scheduler that divides available CPU bandwidth between cgroups.

Continuing with Kubernetes as an example, a defaulted `GOMAXPROCS` value
compounded by a CFS quota-unaware runtime means your Go service `Pod`, complete
with carefully considered CPU resource limits and request specs, can find itself
being **aggressively and unduly throttled** by the CFS.

Why is this? Well say for instance your Go service `Pod` spec has a CPU resource
limit of 300m (millicpu) and taking the Linux kernel's stock CFS quota window of
100ms, this gives the Go service 30ms of CPU time per window. If it tries to use
more than that it gets throttled by the CFS until the next window. This is fine
and is presumably expected because you scientifically benchmarked your service
process locally and landed on that 300m request in the first place (right?).

However, the key thing to remember is that 30ms is actually further subdivided
between `GOMAXPROCS` OS threads, so if your `Pod` happens to land on a large
commoditised host VM with, for simplicity's sake, 15 logical CPUs (as is common
in binpack-styled Kubernetes cluster topologies) then your Go service will have
naively set `GOMAXPROCS` to 15, giving each resulting OS thread potentially just
**2ms** of CPU time per scheduling window before it gets preempted!

The result is a Go runtime scheduler wasting all its allotted CPU time on
context switching and getting no useful work done because it thinks it has
access to 15 logical CPUs when in fact it has access to a fractional 0.3.

> NOTE: To see if this is affecting Kubernetes services you are responsible for, the kubelet cAdvisor metric `container_cpu_cfs_throttled_periods_total` is king.

`GOMAXPROCS` is an integer so your only recourse in the example above is to
hardcode it to 1. This can be done either through the environment with `export GOMAXPROCS=1`, or with the package func `runtime.GOMAXPROCS(1)`.

More generally though, I would recommend Uber's [automaxprocs](https://github.com/uber-go/automaxprocs) drop-in to make
your Go runtime CFS-aware. For Kubernetes operators, you could also disable CFS
quota enforcement at the [kubelet level](https://kubernetes.io/docs/reference/command-line-tools-reference/kubelet/) if you were so inclined.
